[
  {
    "name": "Grand Theft Auto 5",
    "price": 6,
    "category": "Action",
    "img": "https://i.ibb.co/QDB9H8C/gta5.jpg",
    "description": "Grand Theft Auto V is a 2013 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the seventh main entry in the Grand Theft Auto series, following 2008's Grand Theft Auto IV, and the fifteenth instalment overall. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three protagonists—retired bank robber Michael De Santa, street gangster Franklin Clinton, and drug dealer and gunrunner Trevor Philips—and their attempts to commit heists while under pressure from a corrupt government agency and powerful criminals. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles.\n\nThe game is played from either a third-person or first-person perspective, and its world is navigated on foot and by vehicle. Players control the three lead protagonists throughout single-player and switch among them, both during and outside missions. The story is centred on the heist sequences, and many missions involve shooting and driving gameplay. A \"wanted\" system governs the aggression of law enforcement response to players who commit crimes. Grand Theft Auto Online, the game's online multiplayer mode, lets up to 30 players engage in a variety of different cooperative and competitive game modes.\n\nThe game's development began around the time of Grand Theft Auto IV's release and was shared between many of Rockstar's studios worldwide. The development team drew influence from many of their previous projects such as Red Dead Redemption and Max Payne 3 and designed the game around three lead protagonists to innovate on the core structure of its predecessors. Much of the development work constituted the open world's creation, and several team members conducted field research around California to capture footage for the design team. The game's soundtrack features an original score composed by a team of producers who collaborated over several years. It was released in September 2013 for the PlayStation 3 and Xbox 360, in November 2014 for the PlayStation 4 and Xbox One, in April 2015 for Microsoft Windows, and in March 2022 for the PlayStation 5 and Xbox Series X/S.\n\nExtensively marketed and widely anticipated, the game broke industry sales records and became the fastest-selling entertainment product in history, earning $800 million in its first day and $1 billion in its first three days. It received critical acclaim, with praise directed at its multiple protagonist design, open world, presentation and gameplay. However, it caused controversies related to its depiction of violence and women. Considered one of seventh and eighth generation console gaming's most significant titles and among the best video games ever made, it won year-end accolades including Game of the Year awards from several gaming publications. It is the second best-selling video game of all time with over 165 million copies shipped, and as of April 2018, one of the most financially successful entertainment products of all time, with about $6 billion in worldwide revenue."
  },
  {
    "name": "FIFA 22",
    "price": 7.5,
    "category": "Sports",
    "img": "https://i.ibb.co/fpkBntz/fifa22.jpg",
    "description": "FIFA 22 is a football simulation video game published by Electronic Arts. It is the 29th installment in the FIFA series, and was released worldwide on 1 October 2021 for Microsoft Windows, Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One and Xbox Series X/S. Players who pre-ordered the ultimate edition, however, received 4 days of early access and were able to play the game from 27 September."
  },
  {
    "name": "Need for Speed Hot Pursuit",
    "price": 5.5,
    "category": "Racing",
    "img": "https://i.ibb.co/ssXqvtM/nfs.jpg",
    "description": "Need for Speed: Hot Pursuit is a 2010 racing video game developed by Criterion Games and published by Electronic Arts for PlayStation 3, Xbox 360, Wii, Microsoft Windows, iOS, Android, webOS, and Windows Phone. The Wii version was developed by Exient Entertainment. Hot Pursuit is the sixteenth Need for Speed title and was released in November 2010, with digital distribution versions released within December 2010. This version is a reboot of Need for Speed III: Hot Pursuit (1998). A remastered version, titled Need for Speed: Hot Pursuit Remastered, was released on November 6, 2020, for Microsoft Windows, PlayStation 4 and Xbox One, and on November 13, 2020, for Nintendo Switch.\n\nHot Pursuit's gameplay is set in the fictional Seacrest County, which is based on the American states of California, Oregon and Washington, in which players can compete in several types of races. Players can compete online (except in the Wii version), which includes additional game modes such as Hot Pursuit, Interceptor and Race. The game features a new social interaction system called \"Autolog\", which is a network that connects friends for head-to-head races and compares player stats for competition. The game also features paid downloadable content in the form of new cars, new race and pursuit events, and new trophies and achievements.\n\nHot Pursuit was well received by critics at E3 2010 and was most notably awarded with \"Best Racing Game\" from the 2010 Game Critics Awards as well as several other media outlets. It won several Best Racing Game awards, including Best Driving Game at the Spike 2010 Video Game Awards. The game also won a BAFTA Award for its Autolog multiplayer component."
  },
  {
    "name": "Mafia: Definitive Edition",
    "price": 10,
    "category": "Action-Adventure",
    "img": "https://i.ibb.co/PZTN00Y/mafia.jpg",
    "description": "Mafia: Definitive Edition is a 2020 action-adventure game developed by Hangar 13 and published by 2K Games. It is a remake of the 2002 video game Mafia, and the fourth main installment in the Mafia series. Like the original game, the remake is set within the fictional city of Lost Heaven, Illinois during the 1930s, and follows the rise and fall of Tommy Angelo, a Sicilian-American cab driver-turned-gangster, within the Salieri crime family.\n\nThe game's open world nature allows players to explore Lost Heaven at their leisure when not completing missions to advance the narrative. This is mostly done in the Free Ride game mode, where players are not restricted by the linear nature of missions and can find hidden side missions and collectibles exclusive to this mode. The gameplay builds upon 2016's Mafia III, and features enhanced mission dynamics and the introduction of motorcycles to the series. While some of the veteran Czech Mafia voice cast returned for the remake, the English voices were recast. An original score was also created for the game.\n\nThe game was released for Microsoft Windows, PlayStation 4, and Xbox One on September 25, 2020, both individually and as part of the Mafia: Trilogy pack, which also includes a remastered version of the second game and a version of the third game comprised with its additional story packs. It received generally favorable reviews from critics, with praise for revitalizing the story, performances, and graphics, yet faced some criticism over its animations."
  },
  {
    "name": "Fortnite",
    "price": 6,
    "category": "Action-Adventure",
    "img": "https://i.ibb.co/Rj0PJtq/fortnite.jpg",
    "description": "Fortnite is an online video game developed by Epic Games and released in 2017. It is available in three distinct game mode versions that otherwise share the same general gameplay and game engine: Fortnite Battle Royale, a free-to-play battle royale game in which up to 100 players fight to be the last person standing; Fortnite: Save the World, a cooperative hybrid tower defense-shooter and survival game in which up to four players fight off zombie-like creatures and defend objects with traps and fortifications they can build; and Fortnite Creative, in which players are given complete freedom to create worlds and battle arenas.\n\nSave the World and Battle Royale were released in 2017 as early access titles, while Creative was released on December 6, 2018. While the Save the World and Creative versions have been successful for Epic Games, Fortnite Battle Royale in particular became an overwhelming success and a cultural phenomenon, drawing more than 125 million players in less than a year, earning hundreds of millions of dollars per month. Fortnite as a whole generated $9 billion in gross revenue up until December 2019.\n\nSave the World is available only for Windows, macOS, PlayStation 4, and Xbox One, while Battle Royale and Creative were released for all those platforms, and also for Nintendo Switch, iOS, and Android devices. The game also launched with the release of the next-generation PlayStation 5 and Xbox Series X/S consoles."
  },
  {
    "name": "WWE 2k20",
    "price": 6.5,
    "category": "Sports",
    "img": "https://i.ibb.co/J5DGcM7/wwe20.jpg",
    "description": "WWE 2K20 is a professional wrestling video game developed by Visual Concepts and published by 2K Sports. It was released worldwide on October 22, 2019, for Microsoft Windows, PlayStation 4, and Xbox One. It is the twenty-first installment of the WWE series, the seventh under the WWE 2K banner, and the successor to WWE 2K19. 2K20 is the first game in the series not to be developed by Yuke's, which had developed every entry in the series since its inception in 2000. Visual Concepts, who had previously worked with Yuke's as co-developers since 2014, took over as lead studio for the series."
  },
  {
    "name": "Red Dead Redemption 2",
    "price": 10,
    "category": "Action-Adventure",
    "img": "https://i.ibb.co/WBhpXXX/rdr2.jpg",
    "description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption. The story is set in 1899 and follows the exploits of outlaw Arthur Morgan, a member of the Van der Linde gang, in a fictionalized representation of the Western, Midwestern, and Southern United States. Arthur must deal with the decline of the Wild West whilst attempting to survive against government forces, rival gangs, and other adversaries. The game's epilogue follows fellow gang member John Marston, the protagonist of Red Dead Redemption.\n\nThe game is presented through both first and third-person perspectives, and the player may freely roam in its interactive open world. Gameplay elements include shootouts, heists, hunting, horseback riding, interacting with non-player characters, and maintaining the character's honor rating through moral choices and deeds. A bounty system similar to the \"wanted\" system from the Grand Theft Auto franchise governs the response of law enforcement and bounty hunters to crimes committed by the player. Red Dead Online, the game's online multiplayer mode, lets up to 32 players engage in a variety of cooperative and competitive game modes.\n\nThe game's development lasted over eight years, beginning soon after Red Dead Redemption's release, and it became one of the most expensive video games ever made. Rockstar co-opted all of its studios into one large team to facilitate development. They drew influence from real locations as opposed to film or art, focused on creating an accurate reflection of the time with the game's characters and world. The game was Rockstar's first built specifically for eighth generation consoles, having tested their technical capabilities while porting Grand Theft Auto V to the platforms. The game's soundtrack features an original score composed by Woody Jackson and several vocal tracks produced by Daniel Lanois. Red Dead Redemption 2 was released for the PlayStation 4 and Xbox One in October 2018, and for Microsoft Windows and Stadia in November 2019.\n\nWidely anticipated and marketed before release, Red Dead Redemption 2 broke several records and had the second-biggest launch in the history of entertainment, generating US$725 million in sales from its opening weekend and exceeding the lifetime sales of Red Dead Redemption in two weeks. It received critical acclaim, with praise directed at its story, characters, open world, graphics, music, and level of detail; some criticism was directed at its control scheme and emphasis on realism over player freedom. Considered an example of video games as an art form as well as one of the greatest video games ever made, it won year-end accolades including Game of the Year awards from several gaming publications. It is also among the best-selling video games with over 44 million copies shipped."
  },
  {
    "name": "Battlefield 2042",
    "price": 8,
    "category": "First-Person Shooter",
    "img": "https://i.ibb.co/98X3PJw/battlefield2042.jpg",
    "description": "Similar to its predecessors, Battlefield 2042 is a multiplayer-focused first-person shooter. As the game is set in the near future, it features futuristic weapons and gadgets like deployable turrets and drones, as well as vehicles that players can control. Players can request a vehicle air-drop to any location. The game introduced a \"Plus\" system which allows players to customize their weapons on the spot. The class system is significantly overhauled and removes the four defined classes from previous games; instead, players can assume control of a specialist who falls under the four traditional Battlefield gameplay classes of Assault, Engineer, Medic, and Recon. These characters can wield any of the weapons and gadgets that a player has unlocked. Each operator has their own unique skills and gadgets. For instance, one of the specialists, Emma \"Sundance\" Rosier, is equipped with a wingsuit, while another, Maria Falck, is equipped with a healing pistol. Levolution and destructive environments from Battlefield 4 return in Battlefield 2042, and extreme weather effects such as tornadoes and sandstorms which may affect gameplay. The game featured seven maps at launch, including 'Breakaway', the largest map in the history of the Battlefield franchise."
  },
  {
    "name": "Far Cry 6",
    "price": 7.5,
    "category": "Action-Adventure, First-Person Shooter",
    "img": "https://i.ibb.co/Z2tP1Cv/farcry6.jpg",
    "description": "Far Cry 6 is a 2021 action-adventure first-person shooter game developed by Ubisoft Toronto and published by Ubisoft. It is the sixth main installment in the Far Cry series and the successor to 2018's Far Cry 5. The game is set on the fictional Caribbean island of Yara, ruled as a dictatorship by \"El Presidente\" Antón Castillo (portrayed by Giancarlo Esposito) who is raising his son Diego (Anthony Gonzalez) to follow in his rule. Players take on the role of guerilla fighter Dani Rojas (voiced by either Nisa Gunduz or Sean Rey), attempting to topple Castillo and his regime. Gameplay focuses on combat and exploration; players fight enemy soldiers and dangerous wildlife using a wide array of weapons and gadgets. The game features many elements found in role-playing games, such as a leveling up system and side quests. It also features a cooperative multiplayer mode.\n\nDevelopment of Far Cry 6 began around 2016 and was extensive. The team studied several revolutions of recent history for the game's narrative, primarily the Cuban Revolution of 1953–1959. The game was designed to be 'political', covering themes such as the rise of fascism in a nation, the costs of imperialism, and the need for free-and-fair elections, in response to the controversy generated by Far Cry 5. The development team also sought to bring back several elements from earlier Far Cry titles such as a tropical setting and a fully voiced protagonist. The game was first teased by Esposito in July 2020, and officially announced later that month, at the Ubisoft Forward online event.\n\nFar Cry 6 was released worldwide for Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, Stadia, and Amazon Luna on October 7, 2021. It received a generally mixed reception, with critics praising the setting, visuals, Esposito's performance, and the small improvements brought to the series' gameplay formula, but criticizing its story, lack of innovation, and aging design. Several releases of downloadable content were subsequently published, including three expansion packs following antagonists from past Far Cry games."
  }
]
